# Форма слова
# Ограничение времени	1 секунда
# Ограничение памяти	64.0 Мб
# Ввод	стандартный ввод или input.txt
# Вывод	стандартный вывод или output.txt
# Большинство сайтов предоставляет возможность оставить комментарии под записями, поэтому необходимо вести их учет. Иногда можно увидеть такую запись:
#
# Комментарии (28)
#
# Нужно составить программу, которая будет записывать слово "комментарий" в нужной форме, например:
#
# 24 комментария
#
# На вход вашей программе подается число, необходимо вывести слово "комментарий" в нужной форме.
#
# Формат ввода
# 2
#
# Формат вывода
# комментария

